In [36]:
# Exp no. : 4
#Aim: Salary Prediction using Linear Regreesion
# Name :Sumit Deshmukh
# Roll no : 21
# Sec: A
# Subject : Data Science 
# Date : 25/07/2023

In [37]:
#importing the basic library
import pandas as pd
import os

In [38]:
os.getcwd()

'C:\\Users\\Prajwal Deshmukh\\Desktop'

In [39]:
os.chdir('C:\\Users\\Prajwal Deshmukh\\Desktop')

In [40]:
df= pd.read_csv("Salary_dataset.csv")

In [41]:
df.head()

   Unnamed: 0  YearsExperience   Salary
0           0              1.2  39344.0
1           1              1.4  46206.0
2           2              1.6  37732.0
3           3              2.1  43526.0
4           4              2.3  39892.0

In [42]:
data.tail()

    Unnamed: 0  YearsExperience    Salary
25          25              9.1  105583.0
26          26              9.6  116970.0
27          27              9.7  112636.0
28          28             10.4  122392.0
29          29             10.6  121873.0

In [43]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       30 non-null     int64
 1   YearsExperience  30 non-null     float64
 2   Salary           30 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 852.0 bytes

In [44]:
df.shape

(30, 3)

In [45]:
df.describe()

       Unnamed: 0  YearsExperience         Salary
count   30.000000        30.000000      30.000000
mean    14.500000         5.413333   76004.000000
std      8.803408         2.837888   27414.429785
min      0.000000         1.200000   37732.000000
25%      7.250000         3.300000   56721.750000
50%     14.500000         4.800000   65238.000000
75%     21.750000         7.800000  100545.750000
max     29.000000        10.600000  122392.000000

In [46]:
df.size

90

In [47]:
df.ndim

2

In [48]:
df.isnull().sum()

Unnamed: 0         0
YearsExperience    0
Salary             0
dtype: int64

In [49]:
df.columns

Index(['Unnamed: 0', 'YearsExperience', 'Salary'], dtype='object')

In [50]:
df.loc[4,"Salary"]

39892.0

In [51]:
df.head(15)

    Unnamed: 0  YearsExperience   Salary
0            0              1.2  39344.0
1            1              1.4  46206.0
2            2              1.6  37732.0
3            3              2.1  43526.0
4            4              2.3  39892.0
5            5              3.0  56643.0
6            6              3.1  60151.0
7            7              3.3  54446.0
8            8              3.3  64446.0
9            9              3.8  57190.0
10          10              4.0  63219.0
11          11              4.1  55795.0
12          12              4.1  56958.0
13          13              4.2  57082.0
14          14              4.6  61112.0

In [23]:
df.loc[4]

Unnamed: 0             4.0
YearsExperience        2.3
Salary             39892.0
Name: 4, dtype: float64

In [24]:
a=(1,2,3,4,5,6,7,8,9,10)

In [25]:
a[1:4]

(2, 3, 4)

In [27]:
df.iloc[1,2]

46206.0

In [28]:
df.head()

   Unnamed: 0  YearsExperience   Salary
0           0              1.2  39344.0
1           1              1.4  46206.0
2           2              1.6  37732.0
3           3              2.1  43526.0
4           4              2.3  39892.0

In [29]:
df.loc[1,"Salary"]

46206.0

In [30]:
x=df.iloc[:, :-1].values 
y=df.iloc[:, :-1].values

In [31]:
a=(1,2,3,4,5,6,7,8,9,10)

In [32]:
a[:2]

(1, 2)

In [33]:
a[2:]

(3, 4, 5, 6, 7, 8, 9, 10)

In [34]:
a[1:6:1]

(2, 3, 4, 5, 6)

In [35]:
print(x)

[[ 0.   1.2]
 [ 1.   1.4]
 [ 2.   1.6]
 [ 3.   2.1]
 [ 4.   2.3]
 [ 5.   3. ]
 [ 6.   3.1]
 [ 7.   3.3]
 [ 8.   3.3]
 [ 9.   3.8]
 [10.   4. ]
 [11.   4.1]
 [12.   4.1]
 [13.   4.2]
 [14.   4.6]
 [15.   5. ]
 [16.   5.2]
 [17.   5.4]
 [18.   6. ]
 [19.   6.1]
 [20.   6.9]
 [21.   7.2]
 [22.   8. ]
 [23.   8.3]
 [24.   8.8]
 [25.   9.1]
 [26.   9.6]
 [27.   9.7]
 [28.  10.4]
 [29.  10.6]]